[
  { "q": "Hi", "a": "Hello! I’m HealthTalk, here to help you with any questions or doubts you have about health." },
  { "q": "How are you?", "a": "I am fine, Thank you." },
  { "q": "Thank you", "a": "Your are welcome, Have a nice day" },
  { "q": "Bye", "a": "Goodbye,Have a nice day" },
  { "q": "balanced diet", "a": "A balanced diet includes fruits, vegetables, whole grains, lean proteins, and healthy fats in the right proportions." },
  { "q": "water", "a": "Most adults need about 2–3 liters of water per day, depending on activity level and climate." },
  { "q": "hours of sleep", "a": "Adults should aim for 7–9 hours of quality sleep each night." },
  { "q": "protein", "a": "Eggs, chicken, fish, lentils, beans, tofu, and nuts are good protein sources." },
  { "q": "reduce stress", "a": "Try deep breathing, meditation, exercise, and spending time on hobbies you enjoy." },
  { "q": "walking", "a": "Yes, walking is excellent for heart health, weight control, and overall fitness." },
  { "q": "exercise", "a": "Aim for at least 150 minutes of moderate exercise each week." },
  { "q": "dehydration", "a": "Thirst, dark urine, dry mouth, and dizziness can indicate dehydration." },
  { "q": "fiber", "a": "Whole grains, fruits, vegetables, beans, and seeds are high in fiber." },
  { "q": "boost immunity", "a": "Eat a nutrient-rich diet, get enough sleep, exercise regularly, and manage stress." },
  { "q": "skipping breakfast", "a": "Yes, skipping breakfast may cause low energy and overeating later in the day." },
  { "q": "BMI", "a": "BMI, or Body Mass Index, is a measure of body fat based on height and weight." },
  { "q": "improve posture", "a": "Sit upright, keep shoulders back, and take breaks to stretch." },
  { "q": "fatigue causes", "a": "Lack of sleep, poor diet, dehydration, and stress can cause fatigue." },
  { "q": "fruit servings", "a": "2–4 servings of fresh fruit are recommended daily." },
  { "q": "nuts health", "a": "Yes, in moderation — they provide healthy fats, protein, and vitamins." },
  { "q": "protect eyes", "a": "Take screen breaks, wear sunglasses outdoors, and eat foods rich in vitamin A." },
  { "q": "hand wash", "a": "Use soap and water, scrubbing for at least 20 seconds." },
  { "q": "daily coffee", "a": "Yes, in moderation — about 1–3 cups for most adults." },
  { "q": "prevent colds", "a": "Wash hands often, eat healthy, stay hydrated, and get enough rest." },
  { "q": "vitamin D deficiency", "a": "Fatigue, bone pain, and frequent illness may be signs." },
  { "q": "smoothies", "a": "Yes, if made with fresh fruits, vegetables, and minimal added sugar." },
  { "q": "whole grains", "a": "Whole grains include brown rice, oats, quinoa, and whole wheat." },
  { "q": "weight loss no exercise", "a": "Yes, by maintaining a calorie deficit, but exercise improves results and health." },
  { "q": "sugar limit", "a": "Limit added sugars to less than 25–30 grams per day." },
  { "q": "healthy blood pressure", "a": "Around 120/80 mmHg is considered normal." },
  { "q": "manage anxiety", "a": "Practice deep breathing, mindfulness, regular exercise, and talk to a professional if needed." },
  { "q": "green tea benefits", "a": "It may boost metabolism, support brain health, and provide antioxidants." },
  { "q": "good hygiene", "a": "Regular bathing, handwashing, dental care, and wearing clean clothes." },
  { "q": "improve digestion", "a": "Eat fiber-rich foods, drink water, and avoid overeating." },
  { "q": "healthy snacks", "a": "Nuts, yogurt, fruit, boiled eggs, and vegetable sticks." },
  { "q": "overweight check", "a": "Use BMI or consult a healthcare provider." },
  { "q": "lower cholesterol", "a": "Eat more fiber, avoid trans fats, and exercise regularly." },
  { "q": "mental health", "a": "Mental health refers to emotional, psychological, and social well-being." },
  { "q": "protect heart", "a": "Eat healthy, stay active, maintain a healthy weight, and avoid smoking." },
  { "q": "strong bones", "a": "Eat calcium-rich foods and get enough vitamin D." },
  { "q": "eat late at night", "a": "Occasionally, yes, but avoid heavy, high-sugar meals before bed." },
  { "q": "healthy cooking oil", "a": "Olive oil, canola oil, and avocado oil are good choices." },
  { "q": "mindfulness", "a": "Mindfulness means being fully present and aware in the moment." },
  { "q": "daily eggs", "a": "Yes, for most people, eggs are safe and nutritious daily." },
  { "q": "avoid overeating", "a": "Eat slowly, use smaller plates, and stop when you feel satisfied." },
  { "q": "probiotics", "a": "Probiotics are good bacteria that support digestive health." },
  { "q": "improve lung health", "a": "Avoid smoking, exercise regularly, and breathe fresh air." },
  { "q": "frozen vegetables", "a": "Yes, they retain most nutrients if frozen soon after harvest." },
  { "q": "lose belly fat", "a": "Combine healthy eating, regular exercise, and stress management." },
  { "q": "stay active at work", "a": "Take short walks, stretch often, and use stairs instead of elevators." },
  { "q": "antioxidants", "a": "Substances that help protect cells from damage, found in fruits and vegetables." },
  { "q": "healthy skin", "a": "Stay hydrated, eat well, and protect from excessive sun exposure." },
  { "q": "skip lunch", "a": "Skipping meals may lower energy and cause overeating later." },
  { "q": "health checkup frequency", "a": "Once a year is recommended for most adults." },
  { "q": "prevent tooth decay", "a": "Brush twice daily, floss regularly, and limit sugary foods." },
  { "q": "quit smoking", "a": "Seek support, use nicotine replacement therapy, and avoid triggers." },
  { "q": "stress illness", "a": "Yes, chronic stress can weaken immunity and increase disease risk." },
  { "q": "iron rich foods", "a": "Eat spinach, red meat, lentils, beans, and fortified cereals." },
  { "q": "healthy veggie cooking", "a": "Steam or sauté lightly to retain nutrients." },
  { "q": "maintain healthy weight", "a": "Eat balanced meals, exercise regularly, and avoid overeating." },
  { "q": "omega-3 fatty acids", "a": "Healthy fats found in fish, flaxseeds, and walnuts." },
  { "q": "daily milk", "a": "Yes, if you’re not lactose intolerant, milk provides calcium and protein." },
  { "q": "trans fats", "a": "Unhealthy fats found in processed foods that raise bad cholesterol." },
  { "q": "prevent back pain", "a": "Maintain good posture, exercise, and lift objects properly." },
  { "q": "yoga benefits", "a": "Yoga improves flexibility, reduces stress, and supports mental health." },
  { "q": "control high blood pressure", "a": "Reduce salt, exercise, eat healthy, and manage stress." },
  { "q": "flu symptoms", "a": "Fever, chills, body aches, sore throat, and fatigue." },
  { "q": "vitamin C role", "a": "It supports immunity, skin health, and wound healing." },
  { "q": "daily supplements", "a": "Yes, if recommended by a healthcare professional." },
  { "q": "avoid holiday overeating", "a": "Eat small portions, avoid mindless snacking, and drink water." },
  { "q": "exercise when sick", "a": "Light activity is fine for mild illness, but rest if symptoms are severe." },
  { "q": "food poisoning signs", "a": "Nausea, vomiting, diarrhea, and stomach cramps." },
  { "q": "healthy breakfast", "a": "A meal with protein, fiber, and healthy fats like oatmeal with fruit and nuts." },
  { "q": "reduce salt intake", "a": "Cook at home, use herbs for flavor, and avoid processed foods." },

  { "q": "dark chocolate", "a": "Yes, in moderation, it contains antioxidants and minerals." },
  { "q": "complex carbs", "a": "Whole grains, vegetables, and legumes that provide steady energy." },
  { "q": "avoid burnout", "a": "Take breaks, set boundaries, and practice self-care." },
  { "q": "juice vs fruit", "a": "Whole fruits are better because they have fiber." },
  { "q": "intermittent fasting", "a": "An eating pattern where you alternate between eating and fasting periods." },
  { "q": "prevent constipation", "a": "Eat fiber-rich foods, drink water, and exercise regularly." },
  { "q": "honey vs sugar", "a": "Honey has more nutrients but should still be used in moderation." },
  { "q": "improve metabolism", "a": "Exercise, eat enough protein, and stay active throughout the day." },
  { "q": "low-calorie snacks", "a": "Cucumber slices, carrot sticks, air-popped popcorn, and berries." },
  { "q": "moderate alcohol", "a": "Yes, but limit to one drink a day for women and two for men." },

  { "q": "stretching benefits", "a": "It improves flexibility, reduces injury risk, and relieves tension." },
  { "q": "prevent sunburn", "a": "Wear sunscreen, seek shade, and wear protective clothing." },
  { "q": "green tea at night", "a": "Yes, but avoid if caffeine affects your sleep." },
  { "q": "eat healthy on budget", "a": "Buy seasonal produce, cook at home, and avoid processed snacks." },
  { "q": "magnesium deficiency", "a": "Muscle cramps, fatigue, and irregular heartbeat." },
  { "q": "fad diets safety", "a": "Most fad diets are not sustainable or balanced for long-term health." },
  { "q": "immune system winter", "a": "Eat vitamin-rich foods, stay active, and get enough sleep." },
  { "q": "lemon water benefits", "a": "It helps with hydration, digestion, and vitamin C intake." },
  { "q": "sleep and weight gain", "a": "Yes, poor sleep can increase hunger and slow metabolism." },
  { "q": "reduce sugar cravings", "a": "Eat balanced meals, stay hydrated, and choose healthy snacks." },

  { "q": "dehydration headache", "a": "A headache caused by lack of fluids in the body." },
  { "q": "plant-based diet", "a": "Yes, if well-balanced with protein, vitamins, and minerals." },
  { "q": "healthy cooking methods", "a": "Steaming, baking, grilling, and sautéing with minimal oil." },
  { "q": "protect mental health", "a": "Maintain social connections, manage stress, and seek help when needed." },
  { "q": "skipping dinner", "a": "Not regularly — it may cause nutrient deficiencies and low energy." },
  { "q": "good bedtime snacks", "a": "A banana, warm milk, or a handful of nuts can promote sleep." }
]
